'======================Переменные================='

"Переменные - это ссылки на ячейку памяти, где хранятся какие-то данные. Для дальнейшего использования"


name = 'Tima'
age = 25

num1 = 15
num2 = 20
# print(num1 + num2)


'==================как можно и нельзя назыавать переменные=================='

a = 'Tima' # можно, но значение не понятно 
# 1num = 12 - нелзя начинать переменные с чисел
# num-df = 13 - нельзя иссполтзовать символы кроме '_'
# hello world - нельзя использовать пробелы в переменной 
# print = 'print' нельзя называть переменные встроенными словами из питона 



#Snake case - python стиль наимования переменных
my_name = 'Nuraiym'

#Came1 case - стиль остальнвх языков прогромирования
MyName = 'Nuraiym'

'================Вывод и ввод данных===================='
# print() - для вывода данных в терминал
# input() - для ввода данных с терминала

# print('makers')

name = input('Введите ваше имя: ')

# print(name)

# int переводит строку в число

a = 5
b = 4
# print(a + b)



'====================Типы данных================='
#типы данных делятся на два типа изминяемые и неизменяемые

'-----------------------Изменяемые типы данных-------------------------'
list_ = [1,2,3,'makers', True]
# dict_ = ['a':1, 'b':12, 'c':0]
set_ = [1, 2, 13, 10, True]


'----------------------------Неизменяемые типы данных------------------------'
int_ = 15
float_ = 0.5
conplex_ = 8j
decimal_ = 0.9858303859
str_ = 'makers'
tuple_ = (1, 2, 123, -7, 0)
boolean_1 = True
boolean_2 = False
none_type = None




num1 = 3
num2 = 5
 
# print(num1 + num2) #сложение
# print(num1 * num2) #умножение
# print(num1 - num2) #вычитание
# print(num1 / num2) #дробное деление
# print(num1 // num2) #целостное деление
# print(num1 % num2) #деление по остатку
# print(num1 ** num2) #возведение в степень
# print(num1 ** 0.5) #корень числа

# print(sqrt(num1)) #корень числа
# print(abs(-num1)) #модуль числа (перевод с негфтив в поситив или наоборот)
# print(round(5.6)) #округление в большую (округление идет только по первой цифре после точки)
# print(pow(2, 3)) #возведение в степень
# print(divmod(5, 2)) 

#divmod - это функция которая возвращает числа
#1 число это - целостное деление 
#2 число это - деление по остатку





